Revit 2024 API
BuiltInFailures.InterferenceFailures.GeometryWarning Property
 A geometrical error has occurred while checking for Interference. Reported interference may not be accurate.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId GeometryWarning { get; }
Visual Basic
Public Shared ReadOnly Property GeometryWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ GeometryWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.InterferenceFailures Class
Autodesk.Revit.DB Namespace